// SPDX-License-Identifier: Apache-2.0
pragma solidity >=0.5.0 <0.8.0;

// จงเขียนโปรแกรม Smart Contract สำหรับการสร้างคำร้องขอเครมประกับโดยให้ข้อมูล คำร้อง จำเป็นจะต้องเก็บข้อมูลดังต่อไปนี้
// ข้อมูลการเคลมประกัน:
//     • ชื่อผู้เคลม
//     • หมายเลขกรมธรรม์
//     • ประเภทการเคลม
//         ◦ อุบัติเหตุ
//         ◦ สุขภาพ
//         ◦ ทรัพย์สิน
//     • จำนวนเงินที่เคลม
//     • วันที่เกิดเหตุ
//     • รายละเอียดเหตุการณ์
//     1. ผู้ใช้สามารถสร้างคำร้องขอเคลมประกันโดยระบุข้อมูลที่จำเป็นต่างๆ หลังจากนั้น Smart Contract 
//        จะบันทึกคำร้องขอเคลม
//     2. Smart Contract จะต้องสามารถใช้ ID ของคำร้องขอเคลมเพื่อค้นหาคำร้องขอเคลมดังกล่าวได้ในภายหลัง
//     3. Smart Contract จะต้องมีการกำหนดสิทธิ์ให้พนักงานประกันภัยเพื่อเรียกใช้คำสั่งยืนยันหรือปฏิเสธคำร้องขอเคลม
//     4. Smart Contract จะต้องอนุญาตให้ผู้ใช้สามารถแก้ไขคำร้องขอเคลมได้
//        หากคำร้องขอเคลมนั้นยังไม่ได้รับการยืนยันหรือปฏิเสธโดยพนักงานประกันภัย

contract SimpleInsurance {

    // implementing here...

}